#include"function函数.h"
using namespace std;
void menu()					//功能：交互界面制作
{
	cout << '\n';
	cout << '\n';
	cout << '\n';
	cout << "                ====================欢迎使用朴素贝叶斯垃圾邮件筛选系统====================" << endl;
	cout << endl;
	cout << "                |--------------------------------------------------------------------------|" << endl;
	cout << "                |                                                                          |" << endl;
	cout << "                |                                                                          |" << endl;
	cout << "                |>>训练程序        请输入1-------------------------------------------------|" << endl;
	cout << "                |>>查看训练数据    请输入2                                                 |" << endl;
	cout << "                |>>判断邮件        请输入3-------------------------------------------------|" << endl;
	cout << "                |>>注意事项        请输入4-------------------------------------------------|" << endl;
	cout << "                |>>退出程序        请输入5-------------------------------------------------|" << endl;
	cout << "                |                                                                          |" << endl;
	cout << "                |                                                                          |" << endl;
	cout << "                |--------------------------------------------------------------------------|" << endl;
	cout << "                |                       请在以上选项中选择您的操作                         |" << endl;
	cout << "                |请输出操作字符：                                                          |" << endl;
	cout << "                |                                                                          |" << endl;
	cout << "                |                                                                          |" << endl;
	string a;
	cin >> a;
	if (a == "1") {				//字符为1 功能：训练数据
		system("cls");
		dic.practise();
		system("pause");
		system("cls");
		menu();
	}
	else if (a == "2") {		//字符为2 功能：查看训练数据
		system("cls");
		dic.check();
		system("pause");
		system("cls");
		menu();
	}
	else if (a == "3") {		//字符为3 功能：贝叶斯分析
		system("cls");
		dic.bayesanalyse();
		system("pause");
		system("cls");
		menu();
	}
	else if (a =="4") {			//字符为4 功能：注意事项
		system("cls");
		notice();
		system("pause");
		system("cls");
		menu();
	}
	else if (a == "5") {		//字符为5 功能：退出程序
		system("cls");
		cout << "退出程序！感谢您的使用！" << endl;
	}
	else						//除上述功能字符外，若输入其他字符，系统将提醒重新输入操作字符！
	{
		system("cls");
		cout << "操作无效！请重新输入！" << endl;
		system("pause");
		system("cls");
		menu();
	}
}

void notice()					//功能：查看注意事项
{
	cout << '\n';
	cout << '\n';
	cout << '\n';
	cout << "                *********************欢迎使用朴素贝叶斯垃圾邮件筛选系统*********************" << endl;
	cout << "                                                                                            " << endl;
	cout << "                                               注意事项                                     " << endl;
	cout << "                ****************************************************************************" << endl;
	cout << "                *请注意!                                                                   *" << endl;
	cout << "                *为了程序运行成功，请确保以下几点：                                        *" << endl;
	cout << "                *1.您所需要过滤的邮件为txt格式。                                           *" << endl;
	cout << "                *2.所需过滤邮件保存在本程序的工程同级目录中。                              *" << endl;
	cout << "                *3.请先进行训练操作再进行邮件判断操作！                                    *" << endl;
	cout << "                *4.若输入超过操作范围的字符则需重新输入。                                  *" << endl;
	cout << "                *5.一次只输入一个字符操作。                                                *" << endl;
	cout << "                *                                                                          *" << endl;
	cout << "                ****************************************************************************" << endl;
	cout << '\n';
}








